// - = - = - = - = - = - = - = - = - = - = - = - = - = - = - = -
//
// GitWrapper
//
// Git操作
//
// - = - = - = - = - = - = - = - = - = - = - = - = - = - = - = -
using System;
using System.Collections.Generic;
using System.Linq;
using System.Text;
using System.Threading.Tasks;
using System.Diagnostics;

namespace Util
{
    class GitWrapper
    {
        // - = - = - = - = - = - = - = - = - = - = - = - = - = - = - = -
        // public関数
        // - = - = - = - = - = - = - = - = - = - = - = - = - = - = - = -

        // - = - = - = - = - = - = - = - = - = - = - = - = - = - = - = -
        // ローカルリポジトリ作成(init)
        // -------------------------------------------------------------
        // 引数   | string path : 対象パス
        // -------------------------------------------------------------
        // 戻り値 | なし
        // -------------------------------------------------------------
        // カレントディレクトリを対象とする場合、引数無しでコールすること
        // - = - = - = - = - = - = - = - = - = - = - = - = - = - = - = -
        public static void Git_Init(string path = "")
        {
            string command = "init";

            // パスが指定されている場合のみ、コマンド列に追記
            if (path != "")
            {
                command += " " + path;
            }

            // Gitコマンド発行
            ExecGit(command);
        }

        // - = - = - = - = - = - = - = - = - = - = - = - = - = - = - = -
        // ファイルをステージング(管理下におく)(add)(全ファイル)
        // -------------------------------------------------------------
        // 引数   | なし
        // -------------------------------------------------------------
        // 戻り値 | なし
        // -------------------------------------------------------------
        // カレントディレクトリを対象とする
        // - = - = - = - = - = - = - = - = - = - = - = - = - = - = - = -
        public static void Git_Add()
        {
            // Gitコマンド発行
            ExecGit("add -A");
        }

        // - = - = - = - = - = - = - = - = - = - = - = - = - = - = - = -
        // ファイルをステージング(管理下におく)(add)(対象指定)
        // -------------------------------------------------------------
        // 引数   | string[] files : 対象とするファイル
        // -------------------------------------------------------------
        // 戻り値 | なし
        // -------------------------------------------------------------
        // カレントディレクトリを対象とする
        // - = - = - = - = - = - = - = - = - = - = - = - = - = - = - = -
        public static void Git_Add(string[] files)
        {
            string command = "add";

            // 指定されたファイル群をシリアライズ
            foreach(string s in files)
            {
                command += " " + s;
            }

            // Gitコマンド発行
            ExecGit(command);
        }

        // - = - = - = - = - = - = - = - = - = - = - = - = - = - = - = -
        // コミット(commit)
        // -------------------------------------------------------------
        // 引数   | string comment : コミットメッセージ
        // -------------------------------------------------------------
        // 戻り値 | なし
        // -------------------------------------------------------------
        // カレントディレクトリを対象とする
        // - = - = - = - = - = - = - = - = - = - = - = - = - = - = - = -
        public static void Git_Commit(string comment = "")
        {
            string command = "commit -am ";

            command += "\"";
            command += (comment == "") ? "default message" : comment;
            command += "\"";

            // Gitコマンド発行
            ExecGit(command);
        }

        // - = - = - = - = - = - = - = - = - = - = - = - = - = - = - = -
        // プッシュ(push)
        // -------------------------------------------------------------
        // 引数   | string rep    : プッシュする対象のリモートリポジトリ
        //        | string branch : プッシュする対象のブランチ
        // -------------------------------------------------------------
        // 戻り値 | なし
        // -------------------------------------------------------------
        // カレントディレクトリを対象とする
        // - = - = - = - = - = - = - = - = - = - = - = - = - = - = - = -
        public static void Git_Push(string rep, string branch)
        {
            string command = "push ";

            command += rep;
            command += " ";
            command += branch;

            // Gitコマンド発行
            ExecGit(command);
        }

        // - = - = - = - = - = - = - = - = - = - = - = - = - = - = - = -
        // Herokuにプッシュ(デプロイ)
        // -------------------------------------------------------------
        // 引数   | なし
        // -------------------------------------------------------------
        // 戻り値 | なし
        // -------------------------------------------------------------
        // カレントディレクトリを対象とする
        // - = - = - = - = - = - = - = - = - = - = - = - = - = - = - = -
        public static void Git_Push_Heroku()
        {
            // Gitコマンド発行
            Git_Push("heroku", "master");
        }

        // - = - = - = - = - = - = - = - = - = - = - = - = - = - = - = -
        // Gitコマンドを発行
        // -------------------------------------------------------------
        // 引数   | string command : コマンド(オプションを含む)
        // -------------------------------------------------------------
        // 戻り値 | string : コマンドの実行結果(標準出力された文字列)
        // - = - = - = - = - = - = - = - = - = - = - = - = - = - = - = -
        private static string ExecGit(string command)
        {
            // プロセス生成
            // (標準出力へのリダイレクトを行う)
            Process p = new Process();
            p.StartInfo.CreateNoWindow = true;              //< コンソールウィンドウ : 開かない
            p.StartInfo.RedirectStandardOutput = true;      //< 標準出力のリダイレクト : 行う
            p.StartInfo.UseShellExecute = false;            //< シェル機能 : 使用しない
            p.StartInfo.FileName = "git.exe";
            p.StartInfo.Arguments = command;
            p.Start();

            // 標準出力を読み取る
            string output = p.StandardOutput.ReadToEnd();

            // 終了まで待機する
            p.WaitForExit();
            p.Close();

            return output;
        }

    }       // class SvnWrapper
}       // namespace Util
