// - = - = - = - = - = - = - = - = - = - = - = - = - = - = - = -
//
// SlackWrapper
//
// [static]Slackへのアクセス
// 依存 : WebWrapper
//
// - = - = - = - = - = - = - = - = - = - = - = - = - = - = - = -
using System;
using System.Collections.Generic;
using System.Text.RegularExpressions;

namespace Util
{
    // - = - = - = - = - = - = - = - = - = - = - = - = - = - = - = -
    // SlackWrapper クラス
    // - = - = - = - = - = - = - = - = - = - = - = - = - = - = - = -
    static class SlackWrapper
    {
        // - = - = - = - = - = - = - = - = - = - = - = - = - = - = - = -
        // public 定数
        // - = - = - = - = - = - = - = - = - = - = - = - = - = - = - = -

        // - = - = - = - = - = - = - = - = - = - = - = - = - = - = - = -
        // private 定数
        // - = - = - = - = - = - = - = - = - = - = - = - = - = - = - = -
        // メッセージ投稿URL
        private static readonly string c_Str_SlackUrl = "https://slack.com/api/chat.postMessage";

        // - = - = - = - = - = - = - = - = - = - = - = - = - = - = - = -
        // public メソッド (static)
        // - = - = - = - = - = - = - = - = - = - = - = - = - = - = - = -

        // - = - = - = - = - = - = - = - = - = - = - = - = - = - = - = -
        // 文字列がパターンにマッチするかを確認する
        // -------+-----------------------------------------------------
        // 引数   | String target  : [I]検査対象文字列
        //        | String pattern : [I]パターン
        // -------+-----------------------------------------------------
        // 戻り値 | Boolean : 検査結果
        //        |           true  - マッチする
        //        |           false - マッチしない、またはパターンが不正
        // -------+-----------------------------------------------------
        // 例外   | あり
        // - = - = - = - = - = - = - = - = - = - = - = - = - = - = - = -

    }
}
