'- - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
' SyncHDD2SD.vbs
' 音楽ファイルをSDにコピーする
'- - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
' 使い方
'
' cscript SyncHDD2SD.vbs
'- - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -

'- - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
' 定数定義
'- - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
Const cHDD = "D:\_iTunes\Music"		' HDD側のディレクトリパス
Const cSD  = "V:\AV\Music"			' SD側のディレクトリパス
Const cEXT = "*.m4a"				' ファイル拡張子

'- - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
' 処理
'- - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -

